app/Controllers/Buku.php

SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '2'
---
        // rak (SAFE)
        $id_rak = $this->request->getPost('id_rak');
        if ($id_rak === '' || $id_rak === null) {
            $oldRak = $bukuRakModel->where('id_buku', $id)->first();