app/Controllers/Home.php

    public function index()
    {
        $bukuModel   = new BukuModel();
        $rakModel    = new RakModel();
        $pinjamModel = new PeminjamanModel();
        $dendaModel  = new DendaModel();

        $today = date('Y-m-d');

        // =====================
        // STATISTIK
        // =====================
        $total_buku = $bukuModel->countAll();
        $total_rak  = $rakModel->countAll();

        $dipinjam = $pinjamModel->where('status', 'dipinjam')->countAllResults();

        $terlambat = $pinjamModel
            ->where('status', 'dipinjam')
            ->where('tanggal_kembali <', $today)
            ->countAllResults();

        // FIX DENDANYA
        $total_denda = $dendaModel
            ->selectSum('jumlah_denda')
            ->first()['jumlah_denda'] ?? 0;
---
SELECT COUNT(*) AS `numrows` FROM `buku`
SELECT COUNT(*) AS `numrows` FROM `rak`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
AND `tanggal_kembali` < '2026-04-28'
SELECT SUM(`jumlah_denda`) AS `jumlah_denda`
FROM `denda`
 LIMIT 1


        // =====================
        // AKTIVITAS PINJAM (FIX JOIN)
        // =====================
        $aktivitas_pinjam = $pinjamModel
            ->select('peminjaman.id_peminjaman, peminjaman.tanggal_pinjam, peminjaman.status, peminjaman.id_anggota')
            ->orderBy('id_peminjaman', 'DESC')
            ->limit(5)
            ->findAll();

        // =====================
        // OVERDUE (FIX SEDERHANA TANPA JOIN ERROR)
        // =====================
        $overdue = $pinjamModel
            ->where('status', 'dipinjam')
            ->where('tanggal_kembali <', $today)
            ->orderBy('id_peminjaman', 'DESC')
            ->findAll();
---
SELECT `peminjaman`.`id_peminjaman`, `peminjaman`.`tanggal_pinjam`, `peminjaman`.`status`, `peminjaman`.`id_anggota`
FROM `peminjaman`
ORDER BY `id_peminjaman` DESC
 LIMIT 5
SELECT *
FROM `peminjaman`
WHERE `status` = 'dipinjam'
AND `tanggal_kembali` < '2026-04-28'
ORDER BY `id_peminjaman` DESC