app/Controllers/Peminjaman.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        if ($keyword) {
            $data['peminjaman'] = $this->peminjamanModel
                ->like('id_peminjaman', $keyword)
                ->orLike('status', $keyword)
                ->findAll();
        } else {
            $data['peminjaman'] = $this->peminjamanModel->findAll();
---
SELECT *
FROM `peminjaman`