app/Controllers/Peminjaman.php

    public function index()
    {
        $peminjaman = new PeminjamanModel();

        $data['peminjaman'] = $peminjaman
            ->select('peminjaman.*, users.nama')
            ->join('users', 'users.id = peminjaman.id_anggota', 'left')
            ->findAll();
---
SELECT `peminjaman`.*, `users`.`nama`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id` = `peminjaman`.`id_anggota`

    public function create()
    {
        $bukuModel = new BukuModel();
        $users = new UsersModel();

        $search = $this->request->getGet('search');

        // ✅ FILTER + JOIN PENULIS
        if($search){
            $buku = $bukuModel
                ->select('buku.*, penulis.nama_penulis')
                ->join('kategori', 'kategori.id_kategori = buku.id_kategori')
                ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
                ->like('kategori.nama_kategori', $search)
                ->findAll();
        } else {
            $buku = $bukuModel
                ->select('buku.*, penulis.nama_penulis')
                ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
                ->findAll();
---
SELECT `buku`.*, `penulis`.`nama_penulis`
FROM `buku`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`

                'jumlah' => $qty
            ]);

            $bukuModel->update($id_buku, [
                'tersedia' => $b['tersedia'] - $qty
            ]);
---
UPDATE `buku` SET `tersedia` = 7
WHERE `buku`.`id_buku` IN (8)