app/Controllers/Peminjaman.php

    public function create()
    {
        if (session()->get('role') != 'anggota') {
            return redirect()->to(base_url('peminjaman'));
        }

        $bukuModel = new BukuModel();
        $usersModel = new UsersModel();
        $db = \Config\Database::connect();

        $kategori = $db->table('kategori')->get()->getResultArray();
        $id_kategori = $this->request->getGet('id_kategori');

        $bukuQuery = $bukuModel
            ->select('buku.*, penulis.nama_penulis')
            ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left');

        if ($id_kategori) {
            $bukuQuery->where('buku.id_kategori', $id_kategori);
        }

        $buku = $bukuQuery->findAll();
        $petugas = $usersModel->where('role', 'petugas')->findAll();

        $cartSession = session()->get('cart') ?? [];
        $cart = [];

        foreach ($cartSession as $id => $qty) {
            $b = $bukuModel
                ->select('buku.*, penulis.nama_penulis')
                ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
                ->where('buku.id_buku', $id)
                ->first();
---
SELECT *
FROM `kategori`
SELECT `buku`.*, `penulis`.`nama_penulis`
FROM `buku`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
SELECT *
FROM `users`
WHERE `role` = 'petugas'
SELECT `buku`.*, `penulis`.`nama_penulis`
FROM `buku`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
WHERE `buku`.`id_buku` = 8
 LIMIT 1

    $db->transStart();

    // INSERT PEMINJAMAN
    $peminjaman->insert([
        'id_anggota' => session()->get('id'),
        'id_petugas' => null,
        'tanggal_pinjam' => null,
        'tanggal_kembali' => null,
        'status' => 'menunggu'
    ]);
---
INSERT INTO `peminjaman` (`id_anggota`, `id_petugas`, `tanggal_pinjam`, `tanggal_kembali`, `status`) VALUES ('33', '31', '2026-04-24', '2026-05-01', 'dipinjam')

   public function detail($id)
{
    $peminjamanModel = new PeminjamanModel();
    $detailModel = new DetailPeminjamanModel();

    $peminjaman = $peminjamanModel
        ->select('peminjaman.*,
                  anggota.nama as nama_anggota,
                  petugas.nama as nama_petugas')
        ->join('users as anggota', 'anggota.id = peminjaman.id_anggota', 'left')
        ->join('users as petugas', 'petugas.id = peminjaman.id_petugas', 'left')
        ->where('peminjaman.id_peminjaman', $id)
        ->first();

    // 🔥 DEBUG kalau data kosong
    if (!$peminjaman) {
        return redirect()->to(base_url('peminjaman'))
            ->with('error', 'Data peminjaman tidak ditemukan');
    }

    $detail = $detailModel
        ->select('detail_peminjaman.*, buku.judul')
        ->join('buku', 'buku.id_buku = detail_peminjaman.id_buku')
        ->where('detail_peminjaman.id_peminjaman', $id)
        ->findAll();
---
SELECT `peminjaman`.*, `anggota`.`nama` as `nama_anggota`, `petugas`.`nama` as `nama_petugas`
FROM `peminjaman`
LEFT JOIN `users` as `anggota` ON `anggota`.`id` = `peminjaman`.`id_anggota`
LEFT JOIN `users` as `petugas` ON `petugas`.`id` = `peminjaman`.`id_petugas`
WHERE `peminjaman`.`id_peminjaman` = '101'
 LIMIT 1
SELECT `detail_peminjaman`.*, `buku`.`judul`
FROM `detail_peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
WHERE `detail_peminjaman`.`id_peminjaman` = '101'