app/Controllers/Rak.php

UPDATE `rak` SET `nama_rak` = 'C 300-400', `lokasi` = 'Lantai 3'
WHERE `rak`.`id_rak` IN ('3')
---
    public function update($id)
    {
        $this->rakModel->update($id, [
            'nama_rak' => $this->request->getPost('nama_rak'),
            'lokasi'   => $this->request->getPost('lokasi'),
        ]);