app/Controllers/Users.php

SELECT *
FROM `users`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $this->checkAdmin();

        $keyword = $this->request->getGet('keyword');
        $role = $this->request->getGet('role');

        $builder = $this->users;

        if ($keyword) {
            $builder = $builder->like('nama', $keyword);
        }

        if ($role) {
            $builder = $builder->where('role', $role);
        }

        $data['users'] = $builder->paginate(10);

SELECT *
FROM `users`
WHERE `users`.`id` = '32'
---
public function edit($id = null)
{
    if ($id == null) {
        return redirect()->to('/users');
    }

    $data['user'] = $this->users->find($id);

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
    public function delete($id)
    {
        $this->checkAdmin();

        $user = $this->users->find($id);